Merge pull request #13 from vicharanashala/feature/updates
docs: revamp README for MVP release
